tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1503_tdd.h
#define G1EN                          522
#define CWG1CON1                      523
#define G1IS0                         524
#define G1IS                          525
#define G1IS1                         526
#define G1IS2                         527
#define G1ASDLA                       528
#define G1ASDLA0                      529
#define G1ASDLA1                      530
#define G1ASDLB                       531
#define G1ASDLB0                      532
#define G1ASDLB1                      533
#define CWG1CON2                      534
#define G1ASDSCLC2                    535
#define G1ASDSFLT                     536
#define G1ASDSC1                      537
#define G1ASDSC2                      538
#define G1ARSEN                       539
#define G1ASE                         540
#define CLCDATA                       541
#define MCLC1OUT                      542
#define MCLC2OUT                      543
#define CLC1CON                       544
#define LC1MODE0                      545
#define LC1MODE                       546
#define CLC1CON_LCMODE0               547
#define LC1MODE1                      548
#define CLC1CON_LCMODE1               549
#define CLC1CON_LCMODE2               550
#define LC1MODE2                      551
#define LC1INTN                       552
#define CLC1CON_LCINTN                553
#define LC1INTP                       554
#define CLC1CON_LCINTP                555
#define CLC1CON_LCOUT                 556
#define LC1OUT                        557
#define LC1OE                         558
#define CLC1CON_LCOE                  559
#define LC1EN                         560
#define CLC1CON_LCEN                  561
#define CLC1POL                       562
#define LC1G1POL                      563
#define CLC1POL_G1POL                 564
#define CLC1POL_G2POL                 565
#define LC1G2POL                      566
#define LC1G3POL                      567
#define CLC1POL_G3POL                 568
#define LC1G4POL                      569
#define CLC1POL_G4POL                 570
#define CLC1POL_POL                   571
#define LC1POL                        572
#define CLC1SEL0                      573
#define LC1D1S                        574
#define CLC1SEL0_D1S0                 575
#define LC1D1S0                       576
#define CLC1SEL0_D1S1                 577
#define LC1D1S1                       578
#define CLC1SEL0_D1S2                 579
#define LC1D1S2                       580
#define LC1D2S                        581
#define LC1D2S0                       582
#define CLC1SEL0_D2S0                 583
#define LC1D2S1                       584
#define CLC1SEL0_D2S1                 585
#define LC1D2S2                       586
#define CLC1SEL0_D2S2                 587
#define CLC1SEL1                      588
#define LC1D3S0                       589
#define CLC1SEL1_D3S0                 590
#define LC1D3S                        591
#define LC1D3S1                       592
#define CLC1SEL1_D3S1                 593
#define LC1D3S2                       594
#define CLC1SEL1_D3S2                 595
#define LC1D4S                        596
#define LC1D4S0                       597
#define CLC1SEL1_D4S0                 598
#define LC1D4S1                       599
#define CLC1SEL1_D4S1                 600
#define LC1D4S2                       601
#define CLC1SEL1_D4S2                 602
#define CLC1GLS0                      603
#define CLC1GLS0_D1N                  604
#define LC1G1D1N                      605
#define CLC1GLS0_D1T                  606
#define LC1G1D1T                      607
#define LC1G1D2N                      608
#define CLC1GLS0_D2N                  609
#define LC1G1D2T                      610
#define CLC1GLS0_D2T                  611
#define CLC1GLS0_D3N                  612
#define LC1G1D3N                      613
#define CLC1GLS0_D3T                  614
#define LC1G1D3T                      615
#define CLC1GLS0_D4N                  616
#define LC1G1D4N                      617
#define CLC1GLS0_D4T                  618
#define LC1G1D4T                      619
#define CLC1GLS1                      620
#define CLC1GLS1_D1N                  621
#define LC1G2D1N                      622
#define LC1G2D1T                      623
#define CLC1GLS1_D1T                  624
#define CLC1GLS1_D2N                  625
#define LC1G2D2N                      626
#define LC1G2D2T                      627
#define CLC1GLS1_D2T                  628
#define CLC1GLS1_D3N                  629
#define LC1G2D3N                      630
#define LC1G2D3T                      631
#define CLC1GLS1_D3T                  632
#define CLC1GLS1_D4N                  633
#define LC1G2D4N                      634
#define LC1G2D4T                      635
#define CLC1GLS1_D4T                  636
#define CLC1GLS2                      637
#define CLC1GLS2_D1N                  638
#define LC1G3D1N                      639
#define LC1G3D1T                      640
#define CLC1GLS2_D1T                  641
#define LC1G3D2N                      642
#define CLC1GLS2_D2N                  643
#define LC1G3D2T                      644
#define CLC1GLS2_D2T                  645
#define CLC1GLS2_D3N                  646
#define LC1G3D3N                      647
#define LC1G3D3T                      648
#define CLC1GLS2_D3T                  649
#define LC1G3D4N                      650
#define CLC1GLS2_D4N                  651
#define LC1G3D4T                      652
#define CLC1GLS2_D4T                  653
#define CLC1GLS3                      654
#define LC1G4D1N                      655
#define CLC1GLS3_G4D1N                656
#define LC1G4D1T                      657
#define CLC1GLS3_G4D1T                658
#define CLC1GLS3_G4D2N                659
#define LC1G4D2N                      660
#define CLC1GLS3_G4D2T                661
#define LC1G4D2T                      662
#define LC1G4D3N                      663
#define CLC1GLS3_G4D3N                664
#define LC1G4D3T                      665
#define CLC1GLS3_G4D3T                666
#define CLC1GLS3_G4D4N                667
#define LC1G4D4N                      668
#define CLC1GLS3_G4D4T                669
#define LC1G4D4T                      670
#define CLC2CON                       671
#define LC2MODE0                      672
#define LC2MODE                       673
#define CLC2CON_LCMODE0               674
#define LC2MODE1                      675
#define CLC2CON_LCMODE1               676
#define LC2MODE2                      677
#define CLC2CON_LCMODE2               678
#define LC2INTN                       679
#define CLC2CON_LCINTN                680
#define LC2INTP                       681
#define CLC2CON_LCINTP                682
#define CLC2CON_LCOUT                 683
#define LC2OUT                        684
#define LC2OE                         685
#define CLC2CON_LCOE                  686
#define CLC2CON_LCEN                  687
#define LC2EN                         688
#define CLC2POL                       689
#define LC2G1POL                      690
#define CLC2POL_G1POL                 691
#define LC2G2POL                      692
#define CLC2POL_G2POL                 693
#define LC2G3POL                      694
#define CLC2POL_G3POL                 695
#define LC2G4POL                      696
#define CLC2POL_G4POL                 697
#define CLC2POL_POL                   698
#define LC2POL                        699
#define CLC2SEL0                      700
#define LC2D1S0                       701
#define CLC2SEL0_D1S0                 702
#define LC2D1S                        703
#define LC2D1S1                       704
#define CLC2SEL0_D1S1                 705
#define LC2D1S2                       706
#define CLC2SEL0_D1S2                 707
#define LC2D2S0                       708
#define LC2D2S                        709
#define CLC2SEL0_D2S0                 710
#define LC2D2S1                       711
#define CLC2SEL0_D2S1                 712
#define LC2D2S2                       713
#define CLC2SEL0_D2S2                 714
#define CLC2SEL1                      715
#define CLC2SEL1_D3S0                 716
#define LC2D3S0                       717
#define LC2D3S                        718
#define LC2D3S1                       719
#define CLC2SEL1_D3S1                 720
#define LC2D3S2                       721
#define CLC2SEL1_D3S2                 722
#define LC2D4S                        723
#define LC2D4S0                       724
#define CLC2SEL1_D4S0                 725
#define LC2D4S1                       726
#define CLC2SEL1_D4S1                 727
#define LC2D4S2                       728
#define CLC2SEL1_D4S2                 729
#define CLC2GLS0                      730
#define LC2G1D1N                      731
#define CLC2GLS0_D1N                  732
#define CLC2GLS0_D1T                  733
#define LC2G1D1T                      734
#define LC2G1D2N                      735
#define CLC2GLS0_D2N                  736
#define CLC2GLS0_D2T                  737
#define LC2G1D2T                      738
#define LC2G1D3N                      739
#define CLC2GLS0_D3N                  740
#define CLC2GLS0_D3T                  741
#define LC2G1D3T                      742
#define LC2G1D4N                      743
#define CLC2GLS0_D4N                  744
#define CLC2GLS0_D4T                  745
#define LC2G1D4T                      746
#define CLC2GLS1                      747
#define CLC2GLS1_D1N                  748
#define LC2G2D1N                      749
#define CLC2GLS1_D1T                  750
#define LC2G2D1T                      751
#define CLC2GLS1_D2N                  752
#define LC2G2D2N                      753
#define CLC2GLS1_D2T                  754
#define LC2G2D2T                      755
#define LC2G2D3N                      756
#define CLC2GLS1_D3N                  757
#define LC2G2D3T                      758
#define CLC2GLS1_D3T                  759
#define LC2G2D4N                      760
#define CLC2GLS1_D4N                  761
#define LC2G2D4T                      762
#define CLC2GLS1_D4T                  763
#define CLC2GLS2                      764
#define LC2G3D1N                      765
#define CLC2GLS2_D1N                  766
#define CLC2GLS2_D1T                  767
#define LC2G3D1T                      768
#define CLC2GLS2_D2N                  769
#define LC2G3D2N                      770
#define LC2G3D2T                      771
#define CLC2GLS2_D2T                  772
#define CLC2GLS2_D3N                  773
#define LC2G3D3N                      774
#define CLC2GLS2_D3T                  775
#define LC2G3D3T                      776
#define CLC2GLS2_D4N                  777
#define LC2G3D4N                      778
#define LC2G3D4T                      779
#define CLC2GLS2_D4T                  780
#define CLC2GLS3                      781
#define LC2G4D1N                      782
#define CLC2GLS3_G4D1N                783
#define CLC2GLS3_G4D1T                784
#define LC2G4D1T                      785
#define CLC2GLS3_G4D2N                786
#define LC2G4D2N                      787
#define LC2G4D2T                      788
#define CLC2GLS3_G4D2T                789
#define CLC2GLS3_G4D3N                790
#define LC2G4D3N                      791
#define CLC2GLS3_G4D3T                792
#define LC2G4D3T                      793
#define LC2G4D4N                      794
#define CLC2GLS3_G4D4N                795
#define CLC2GLS3_G4D4T                796
#define LC2G4D4T                      797
#define BSR_ICDSHAD                   798
#define STATUS_SHAD                   799
#define C_SHAD                        800
#define DC_SHAD                       801
#define Z_SHAD                        802
#define WREG_SHAD                     803
#define BSR_SHAD                      804
#define PCLATH_SHAD                   805
#define FSR0L_SHAD                    806
#define FSR0H_SHAD                    807
#define FSR1L_SHAD                    808
#define FSR1H_SHAD                    809
#define STKPTR                        810
#define TOSL                          811
#define TOSH                          812

#endif // _PIC16F1503_H_
